In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

#### One hot encoding

In [2]:
path = "C:/Users/DEVENDRA/Desktop/ml_database_7/titanic/train.csv"
df1 = pd.read_csv(path, usecols=['Sex'])

In [3]:
df1.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [4]:
pd.get_dummies(df1, drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [5]:
df1 = pd.read_csv(path, usecols=['Embarked'])

In [6]:
df1.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [7]:
df1['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [8]:
df1.dropna(inplace = True)

In [9]:
pd.get_dummies(df1, drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

In [10]:
path = "C:/Users/DEVENDRA/Desktop/ml_database_7/train/train.csv"
df1 = pd.read_csv(path, usecols=['X0','X1','X2','X3','X4','X5','X6'])
# C:\Users\DEVENDRA\Desktop\ml_database_7\train.csv

In [11]:
df1.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [33]:
# for i in df1.columns:
#     print(df1[i].value_counts())
df1['X0'].value_counts()
for i in df1.columns:
    print(len(df1[i].unique()))

47
27
44
7
4
29
12

In [41]:
df1.X1.value_counts().sort_values(ascending=False).head(10).index

Index(['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o'], dtype='object')

In [43]:
lst_10=df1.X1.value_counts().sort_values(ascending=False).head(10).index
lst_10 = list(lst_10)

In [44]:
lst_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [45]:
for feature in lst_10:
    df1[feature] = np.where(df1['X1']==feature,1,0)

In [48]:
lst_10.append('X1')

In [51]:
df1[lst_10].head()

   aa  s  b  l  v  r  i  a  c  o X1
0   0  0  0  0  1  0  0  0  0  0  v
1   0  0  0  0  0  0  0  0  0  0  t
2   0  0  0  0  0  0  0  0  0  0  w
3   0  0  0  0  0  0  0  0  0  0  t
4   0  0  0  0  1  0  0  0  0  0  v

## Ordinal Number Encoding

In [52]:
import datetime

In [57]:
date = datetime.datetime.today()

In [59]:
date-datetime.timedelta(2)

datetime.datetime(2020, 7, 27, 21, 43, 45, 160529)

In [61]:
days = [date-datetime.timedelta(x) for x in range(0,15)]

In [65]:
date = pd.DataFrame(days)
date.columns=['Days']

In [66]:
date.head()

                        Days
0 2020-07-29 21:43:45.160529
1 2020-07-28 21:43:45.160529
2 2020-07-27 21:43:45.160529
3 2020-07-26 21:43:45.160529
4 2020-07-25 21:43:45.160529

In [74]:
weekdays = date['Days'].dt.weekday_name

In [75]:
date['Weekday'] = date['Days'].dt.weekday_name

In [76]:
date.head()

                        Days    Weekday
0 2020-07-29 21:43:45.160529  Wednesday
1 2020-07-28 21:43:45.160529    Tuesday
2 2020-07-27 21:43:45.160529     Monday
3 2020-07-26 21:43:45.160529     Sunday
4 2020-07-25 21:43:45.160529   Saturday

In [83]:
dictionary = {'Monday':1, 'Tuesday':2, 'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [84]:
dictionary

{'Friday': 5,
 'Monday': 1,
 'Saturday': 6,
 'Sunday': 7,
 'Thursday': 4,
 'Tuesday': 2,
 'Wednesday': 3}

In [87]:
date['Weekday_ordinal'] = date['Weekday'].map(dictionary)

In [88]:
date.head()

                        Days    Weekday  Weekday_ordinal
0 2020-07-29 21:43:45.160529  Wednesday                3
1 2020-07-28 21:43:45.160529    Tuesday                2
2 2020-07-27 21:43:45.160529     Monday                1
3 2020-07-26 21:43:45.160529     Sunday                7
4 2020-07-25 21:43:45.160529   Saturday                6

### Count Or Frequency Encoding

In [13]:
path = 'E:/download july/dataset_183_adult.csv'
data = pd.read_csv(path, na_values = ['?'])
pd.pandas.set_option('display.max_columns', None)

In [14]:
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native-country,class
0,2,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,1,0,2,United-States,<=50K
1,3,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,0,United-States,<=50K
2,2,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,2,United-States,<=50K
3,3,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,2,United-States,<=50K
4,1,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,2,Cuba,<=50K

In [18]:
columns = ['workclass','education','marital-status','occupation','relationship','race','sex','native-country']

In [39]:
cate_feature = [feature for feature in data.columns if data[feature].dtype== 'O' and feature not in 'class']

In [40]:
cate_feature

['workclass',
 'education',
 'marital-status',
 'occupation',
 'relationship',
 'race',
 'sex',
 'native-country']

In [25]:
data1 = data[columns]

In [41]:
for i in cate_feature:
    print(i,len(data[i].unique()), 'Labels')

workclass 9 Labels
education 16 Labels
marital-status 7 Labels
occupation 15 Labels
relationship 6 Labels
race 5 Labels
sex 2 Labels
native-country 42 Labels

### count of frequency Encoding

In [45]:
country_map = data['native-country'].value_counts().to_dict()

In [46]:
data['native-country'] = data['native-country'].map(country_map)

In [47]:
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native-country,class
0,2,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,1,0,2,43832.0,<=50K
1,3,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,0,43832.0,<=50K
2,2,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,2,43832.0,<=50K
3,3,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,2,43832.0,<=50K
4,1,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,2,138.0,<=50K

#### Advantages
1. easy to use
2. Not increasing any feature space

#### Disadvantages
1. It will provide same weight if the frequency is same

### Target Guided Ordinal Encoding
1. ordering the label according the target
2. replace label by the joint probability of being 1 or 0

In [49]:
path = "C:/Users/DEVENDRA/Desktop/ml_database_7/titanic/train.csv"
df1 = pd.read_csv(path, usecols=['Cabin','Survived'])

In [50]:
df1.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [51]:
df1['Cabin'].fillna('Missing', inplace =True)

In [52]:
df1.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [54]:
df1['Cabin']= df1['Cabin'].astype(str).str[0]

In [55]:
df1.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [56]:
df1.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [61]:
df1.groupby(['Cabin'])['Survived'].mean().sort_values(ascending=False)

Cabin
D    0.757576
E    0.750000
B    0.744681
F    0.615385
C    0.593220
G    0.500000
A    0.466667
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [63]:
ordinal_label = df1.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [67]:
ordinal_label

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [68]:
enumerate(ordinal_label, 0)

In [69]:
ordinal_label2 = {k:i for i, k in enumerate(ordinal_label,0)}
ordinal_label2

{'A': 2, 'B': 6, 'C': 4, 'D': 8, 'E': 7, 'F': 5, 'G': 3, 'M': 1, 'T': 0}

In [72]:
df1['Cabin_Ordinal_label'] = df1['Cabin'].map(ordinal_label2)

In [75]:
df1.head()

   Survived Cabin  Cabin_Ordinal_label
0         0     M                    1
1         1     C                    4
2         1     M                    1
3         1     C                    4
4         0     M                    1

### Mean Encoding

In [79]:
mean_encoding = df1.groupby(['Cabin'])['Survived'].mean().to_dict()

In [80]:
df1['mean_ordinal_encoding'] = df1['Cabin'].map(mean_encoding)

In [81]:
df1.head()

   Survived Cabin  Cabin_Ordinal_label  mean_ordinal_encoding
0         0     M                    1               0.299854
1         1     C                    4               0.593220
2         1     M                    1               0.299854
3         1     C                    4               0.593220
4         0     M                    1               0.299854